spec/fixtures/express_checkout/recurring/profile/success.yml

--- 
http_interactions: 
- request: 
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body: 
      encoding: US-ASCII
      string: USER=chardy_api1.gmail.com&PWD=8DTSWBZC7GDR3T4X&SIGNATURE=AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS&VERSION=72.0&PROFILEID=I-1RFWFFS16BF4&METHOD=GetRecurringPaymentsProfileDetails
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Wed, 27 Feb 2013 16:07:40 GMT
      Server: 
      - Apache
      Content-Length: 
      - "948"
      Connection: 
      - close
      Content-Type: 
      - text/plain; charset=utf-8
    body: 
      encoding: ASCII-8BIT
      string: PROFILEID=I%2d1RFWFFS16BF4&STATUS=Cancelled&AUTOBILLOUTAMT=AddToNextBilling&DESC=Awesome%20%2d%20Monthly%20Subscription&MAXFAILEDPAYMENTS=1&SUBSCRIBERNAME=Chardy%Wang&PROFILESTARTDATE=2013%2d02%2d21T08%3a00%3a00Z&PROFILEREFERENCE=1234&NUMCYCLESCOMPLETED=1&NUMCYCLESREMAINING=18446744073709551615&OUTSTANDINGBALANCE=0%2e00&FAILEDPAYMENTCOUNT=0&LASTPAYMENTDATE=2013%2d02%2d22T10%3a20%3a57Z&LASTPAYMENTAMT=9%2e00&TRIALAMTPAID=0%2e00&REGULARAMTPAID=9%2e00&AGGREGATEAMT=9%2e00&AGGREGATEOPTIONALAMT=9%2e00&FINALPAYMENTDUEDATE=1970%2d01%2d01T00%3a00%3a00Z&TIMESTAMP=2013%2d02%2d27T16%3a07%3a40Z&CORRELATIONID=6ee3f605245b4&ACK=Success&VERSION=72%2e0&BUILD=5294323&BILLINGPERIOD=Month&BILLINGFREQUENCY=1&TOTALBILLINGCYCLES=0&CURRENCYCODE=USD&AMT=9%2e00&SHIPPINGAMT=0%2e00&TAXAMT=0%2e00&REGULARBILLINGPERIOD=Month&REGULARBILLINGFREQUENCY=1&REGULARTOTALBILLINGCYCLES=0&REGULARCURRENCYCODE=USD&REGULARAMT=9%2e00&REGULARSHIPPINGAMT=0%2e00&REGULARTAXAMT=0%2e00
    http_version: 
  recorded_at: Wed, 27 Feb 2013 16:07:40 GMT
recorded_with: VCR 2.3.0
